eisup_2019_docmng_integration/src/InformationRegisters/абс_ИнтеграцияCognos_ЛогЗагрузкиБюджета/абс_ИнтеграцияCognos_ЛогЗагрузкиБюджета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ИнтеграцияCognos_ЛогЗагрузкиБюджета</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ORGANIZATION</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CREDIT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>TYPE_CONTR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>FINSTRUCTION</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PROJECT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ACCOUNT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>CURRENCY</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>YEAR</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>SCENARIO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>PERIOD_</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>METHOD</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>160</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>VAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>VALUE</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </resources>
  <resources>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </resources>
  <resources>
    <name>БюджетнаяСтатья</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </resources>
  <resources>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииПланирования</types>
    </type>
  </resources>
  <resources>
    <name>ПериодБюджета</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтрокаОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>NUM_LOAD</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСтроки</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодГод</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ИнтеграцияCognos_ЛогЗагрузкиБюджета/ManagerModule.bsl
Функция ПолучитьСтатусВводаБюджета() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	МАКСИМУМ(абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.NUM_LOAD) КАК NUM_LOAD,
	                      |	абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.Организация,
	                      |	абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.ПериодГод
	                      |ИЗ
	                      |	РегистрСведений.абс_ИнтеграцияCognos_ЛогЗагрузкиБюджета.СрезПоследних КАК абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.Организация,
	                      |	абс_ИнтеграцияCognos_ЛогЗагрузкиБюджетаСрезПоследних.ПериодГод");
						  
	Возврат Запрос.Выполнить().Выгрузить();						  
						  
КонецФункции

Функция ПолучитьДокументыВводаБюджета() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                      |	ВводБюджета.Ссылка КАК Документ,
	                      |	ВводБюджета.Организация,
	                      |	ВводБюджета.Год КАК ПериодГод,
	                      |	ВводБюджета.Сценарий
	                      |ИЗ
	                      |	Документ.абс_ВводБюджета КАК ВводБюджета
	                      |ГДЕ
	                      |	ВводБюджета.Групповой");
						  
	Возврат Запрос.Выполнить().Выгрузить();						  
						  
КонецФункции
